Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: For some components that draw short stubs to which wires can connect (such as an OR gate or a controlled buffer), Logisim will silently correct attempts to create wires that slightly overshoot the stub's end.
ru_ru: Для некоторых компонентов, которые рисуют короткие отрезки, к которым могут быть подключены провода (таких как Элемент ИЛИ и Управляемый буфер), Logisim будет без напоминаний поправлять попытки создания проводов, слегка перекрывающих отрезки.

source: By default, right-clicking or control-clicking a component will bring up this pop-up menu; however, the Mouse tab of the project options allows a user to configure the mouse buttons to work differently.
ru_ru: По умолчанию щелчок правой кнопкой мыши или щелчок с зажатой клавишей Control на компоненте будет вызывать это всплывающее меню; впрочем, вкладка Мышь в параметрах проекта позволяет пользователю настроить кнопки мыши чтобы они работали по-другому.

source: If the Data Bits attribute is more than 1, each gate input is still a single bit, but the gate values are applied simultaneously to each of the source input's bits.
ru_ru: Если значение атрибута Биты данных больше единицы, то каждый вход затвор остаётся однобитным, но значения с затворов применяются одновременно к каждому биту входа исток.

source: -locale localeIdentifier
ru_ru: -locale идентификаторЯзыка

source: The upper multibit input has as many bits as there are columns in the matrix, with the low-order bit corresponding to the rightmost column.
ru_ru: Верхний многобитный вход имеет столько битов, сколько столбцов в матрице; младший бит соответствует правому столбцу.

source: If multiple components include the same location, all components' presence will be toggled.
ru_ru: Если несколько компонентов содержат эту точку, то присутствие/отсутствие всех этих компонентов будет переключено.

source: A pin component has only one pin, which will be an input to the component if the pin is an output pin, and it will be an output to the component if the pin is an input pin.
ru_ru: Компонент Контакт имеет только один контакт, который будет входом для компонента, если компонент является выходным контактом, и будет выходом для компонента, если компонент является входным контактом.

source: cost of physically performing source distribution, a complete
ru_ru: физического акта изготовления копии полную

source: Data value from which bits should be selected for the output.
ru_ru: Входные данные, из которых должны выбираться биты для вывода.

source: Also, if an endpoint of any of the new wire segments hit somewhere in the middle of an existing wire, then that wire will be split into multiple segments itself.
ru_ru: Кроме того, если конечная точка любого из новых сегментов провода касается где-то посередине существующего провода, то тот провод будет разделён на несколько сегментов.

source: This License applies to any program or other work which contains a notice placed by the copyright holder saying it may be distributed under the terms of this General Public License.
ru_ru: Эта Лицензия применима к любой программе или другому произведению, содержащему уведомление, помещенное держателем авторских прав и сообщающее о том, что оно может распространяться при условиях, оговоренных в данной Универсальной Общественной Лицензии.

source: /** Updates the current value emitted by the counter.
ru_ru: /** Обновляет текущее значение, выдаваемое счётчиком.

source: The most straightforward is probably to view the simulation hierarchy by clicking the second icon in the explorer pane's upper toolbar (), or by selecting "View Simulation Tree" from the Project menu.
ru_ru: Проще всего, вероятно, просматривать иерархию моделирования, щёлкнув второй значок в верхней панели инструментов панели проводника (), или выбрав пункт "Показать дерево моделирования" из меню Проект.

source: // index 0 in the parameter array, so we use 0 as the parameter below.
ru_ru: // с индексом 0 в массив-параметр, так что мы используем 0 как параметр ниже.

source: There are additional shortcomings, too, that I have omitted because they are so obscure that if you were aware of them, it would be obvious that Logisim comes nowhere close to that level.
ru_ru: Существуют и другие недостатки, которые я опустил, потому что они настолько глубокие, что если бы вы были осведомлены о них, то было бы очевидно, что Logisim даже близко не подходит к этому уровню.

source: Supported options include the following.
ru_ru: Поддерживаемые параметры следующие.

source: The number of characters that the buffer can hold at once.
ru_ru: Количество символов, которые буфер может одновременно хранить.

source: This feature allows you to reuse common components across projects and to share favorite components with your friends (or students).
ru_ru: Эта возможность позволяет вам повторно использовать общие между проектами компоненты и делиться любимыми компонентами со своими друзьями (или учащимися).

source: // We can just use what super.clone() returns: The only instance variables are
ru_ru: // Мы можем просто использовать то, что возвращает super.clone(): только переменные экземпляра являются

source: It is not the purpose of this section to induce you to infringe any patents or other property right claims or to contest validity of any such claims; this section has the sole purpose of protecting the integrity of the free software distribution system, which is implemented by public license practices.
ru_ru: Цель этого раздела не побудить вас делать заявления о нарушениях прав на патент, или других претензиях на право собственности, или оспаривать правильность подобных претензий; единственная цель этого раздела --- защита целостности системы распространения свободного ПО, которая реализуется использованием общих лицензий.

source: /** Returns the name of the library that the user will see.
ru_ru: /** Возвращает имя библиотеки, которое будет видеть пользователь.

source: If you want to disable this behavior entirely, go to Project > Options, select the Canvas tab, and uncheck the Keep Connections When Moving box; in this case, the connections are computed only when the shift key is down.
ru_ru: Если вы хотите полностью выключить это поведение, выберите Проект > Параметры..., перейдите на вкладку Холст, и снимите флажок Сохранять соединения при перемещении; в этом случае соединения вычисляются, только когда клавиша Shift нажата.

source: The component has an enable input when this attribute is yes. The attribute is primarily for supporting circuits built using older versions of Logisim that did not provide an enable input.
ru_ru: Компонент имеет разрешающий вход, когда значение этого атрибута да. Этот атрибут нужен в основном для поддержки схем, построенных с использованием более старых версий Logisim, которые не предусматривали разрешающий вход.

source: logic circuits
ru_ru: логические схемы

source: This should be a
ru_ru: Это должно быть

source: Compares two values, either as unsigned values or as two's-complement values, depending on the Numeric Type attribute.
ru_ru: Сравнивает два значения как беззнаковые или как дополнения до 2, в зависимости от атрибута Формат числа.

source: Integration with the Macintosh OS X platform.
ru_ru: Интеграция с платформой Macintosh OS X.

source: Text Tool
ru_ru: Инструмент Текст

source: Sometimes it will fail to detect an overlap if the overlap is small — say, less than 5% of either of the objects.)
ru_ru: Иногда он не сможет обнаружить перекрытие, если оно небольшое - скажем, менее 5% любого из объектов.)

source: This is 1 whenever the counter is at its maximum and the load and count inputs indicate that the component should increment on the next step - or when the counter is at 0 and the load and count inputs indicate to decrement at the next step.
ru_ru: На этом выходе 1, когда счётчик имеет своё максимальное значение и входы загрузка и счёт показывают, что значение компонента должно увеличиться на следующем шаге; или когда значение счётчика - 0, и входы загрузка и счёт показывают, что значение компонента должно уменьшиться на следующем шаге.

source: The number of rows displayed in the terminal.
ru_ru: Количество строк, отображаемых в терминале.

source: Disabled Output
ru_ru: На отключенном выходе

source: The bulk of the Combinational Analysis module is accessed through a single window of that name allowing you to view truth tables and Boolean expressions.
ru_ru: К основной части модуля Комбинационный анализ можно получить доступ через единственное окно с таким же именем, оно позволяет просматривать таблицы истинности и логические выражения.

source: IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
ru_ru: НИ В КАКОМ СЛУЧАЕ АВТОРЫ ИЛИ ПРАВООБЛАДАТЕЛИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ПО ИСКАМ О ВОЗМЕЩЕНИИ УЩЕРБА, УБЫТКОВ ИЛИ ДРУГИХ ТРЕБОВАНИЙ ПО ДЕЙСТВУЮЩИМ КОНТРАКТАМ, ДЕЛИКТАМ ИЛИ ИНОМУ, ВОЗНИКШИМ ИЗ, ИМЕЮЩИМ ПРИЧИНОЙ ИЛИ СВЯЗАННЫМ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ ИЛИ ИСПОЛЬЗОВАНИЕМ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ ИЛИ ИНЫМИ ДЕЙСТВИЯМИ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ.

source: Pins (assuming component faces east, control line right-handed)
ru_ru: Контакты (предполагается, что компонент направлен на восток, управляющий вход - по правую руку)

source: The bit width of the component's output.
ru_ru: Разрядность выхода компонента.

source: Any TTY components send their output to the display (standard output), and any information typed at the keyboard is sent to all Keyboard components in the circuit.
ru_ru: Компоненты Терминал посылают свой вывод на дисплей (стандартный вывод), и любая информация, набранная с клавиатуры, посылается всем компонентам Клавиатура в схеме.

source: The remainder of this section is dedicated to a series of thoroughly commented examples illustrating how to develop Logisim libraries yourself.
ru_ru: Оставшаяся часть этого раздела отведена под ряд тщательно прокомментированных примеров, иллюстрирующих, как разрабатывать библиотеки Logisim самостоятельно.

source: Gate shape: Logisim supports three standards for drawing gates: shaped gates, rectangular gates, and DIN 40700 gates.
ru_ru: Форма элементов: Logisim поддерживает три стандарта для отрисовки логических элементов: фигурные элементы, прямоугольные элементы, и элементы DIN 40700.

source: The Mouse tab
ru_ru: Вкладка Мышь

source: Wiring
ru_ru: Проводка

source: This section of the User's Guide explains the interface allowing the user to view and edit memory contents.
ru_ru: Эти разделы руководства пользователя объясняют интерфейс, позволяющий пользователю просматривать и изменять содержимое памяти.

source: // we'll also need configureNewInstance to configure the label's
ru_ru: // нам также нужен configureNewInstance для настройки расположения

source: If distribution of executable or object code is made by offering access to copy from a designated place, then offering equivalent access to copy the source code from the same place counts as distribution of the source code, even though third parties are not compelled to copy the source along with the object code.
ru_ru: Если распространение исполняемого произведения или объектного кода происходит путем предоставления доступа для копирования с обозначенного места, то предоставление доступа для копирования исходного кода с того же места считается распространением исходного кода, даже если третьи лица не принуждаются к копированию исходного кода вместе с объектным кодом.

source: The upper dataBits bits of the product.
ru_ru: Старшие битыДанных битов произведения.

source: This will show the circuit attributes in the attribute table, including the Shared Label, Shared Label Facing, and Shared Label Font attributes.
ru_ru: Это отобразит атрибуты схемы в таблице атрибутов, включая атрибуты Общая метка, Направление общей метки и Шрифт общей метки.

source: The side of the component where its input pin should be.
ru_ru: Сторона компонента, где должен быть его входной контакт.

source: South edge, left side (input, bit width 1)
ru_ru: Южный край, левая сторона (вход, разрядность равна 1)

source: It brings up a window with three tabs.
ru_ru: Это вызовет окно с тремя вкладками.

source: The bit width of the input.
ru_ru: Разрядность входа.

source: Selecting one displays the corresponding circuit.
ru_ru: Выбор одной из них отображает её.

source: (In some circumstances, you may have to type the starting class name when prompted, which would be provided by the library developer.
ru_ru: (В некоторых случаях, вам возможно придётся ввести имя стартового класса, которое должно быть предоставлено разработчиком библиотеки.

source: If there is already a label, you need to click within the label.
ru_ru: Если же метка уже есть, то вам нужно щёлкнуть внутри метки.

source: Edit Tool
ru_ru: Инструмент Правка

source: If you are interested, contact me, Carl Burch.
ru_ru: Если вы заинтересованы, свяжитесь со мной, Карлом Берчем.

source: The Left-handed option (the default) draws a spine going left from the combined end, with a labeled line coming from the spine for each split end.
ru_ru: Вариант Леворукий (по умолчанию) отрисовывает стержень, уходящий налево от объединённого конца, с маркированными линиями, идущими от стержня к каждому разъединённому концу.

source: The counter continues incrementing/decrementing, keeping the number of bits as provided by the Data Bits attribute
ru_ru: Счётчик продолжает увеличение/уменьшение, сохраняя количество битов, указанное в атрибуте Биты данных

source: In the superclass, the method doesn't do anything, since
ru_ru: В суперклассе метод ничего не делает, поскольку

source: The gate input is drawn connected to a plate that is parallel to the plate connecting source to drain.
ru_ru: Вход затвор изображён соединённым с пластиной, параллельной пластине, соединяющей исток со стоком.

source: Pull Resistor
ru_ru: Согласующий резистор

source: RAM
ru_ru: ОЗУ

source: In contrast to all other components in the current built-in libraries, label components can be placed anywhere on the canvas; they do not snap to the grid.
ru_ru: В отличие от всех других компонентов встроенных библиотек на данный момент, метки можно размещать в любом месте на холсте, они не привязываются к сетке.

source: View XXX: Changes the circuit layout being viewed and edited to be the subcircuit's layout instead.
ru_ru: Рассмотреть XXX: сменить просматриваемый и редактируемый чертёж схемы на чертёж определённой подсхемы.

source: The source code is included in the src subdirectory of the distributed JAR file.
ru_ru: Исходный код включен в подкаталог src распространяемого JAR файла.

source: If you would like to share your library with other Logisim users, I will be happy to provide a link to a hosting Web page or the JAR file itself through the Logisim Web site.
ru_ru: Если вы хотите поделиться своими библиотеки с другими пользователями Logisim, я буду рад предоставить ссылку на хостинг веб-страницы или сам JAR файл на сайте Logisim.

source: You can download JAR libraries that others have written, or you can write your own as described in the JAR Libraries section of this guide.
ru_ru: Вы можете скачать JAR библиотеки, написанные другими людьми, или же вы можете написать свои собственные, как описано в разделе Библиотеки JAR этого руководства.

source: The starting value used for the pseudorandom sequence.
ru_ru: Начальное значение, используемое для псевдослучайной последовательности.

source: In this case, the state is in a CounterData object, which is
ru_ru: В данном случае состояние - это объект CounterData, который также есть

source: Gate Size
ru_ru: Размер элемента

source: Typing the Enter key will scroll down one line.
ru_ru: Нажатие клавиши Enter пролистает одну строку вниз.

source: Clock: At the instant that this is triggered as specified by the Trigger attribute, the component steps to the following number in its sequence.
ru_ru: Тактовый вход: в момент срабатывания этого входа (как указано в атрибуте Срабатывание) компонент переходит к следующему числу в последовательности.

source: Typing the space bar will scroll down one page (four lines).
ru_ru: Нажатие пробела пролистает на одну страницу вниз (4 строки).

source: Pressing the mouse button while it is within a currently selected component begins a drag moving all elements of the selection.
ru_ru: Нажатие кнопки мыши, пока мышь находится над выделенным в данный момент компонентом, начинает перетаскивание всех элементов выделения.

source: To modify an attribute value, click on the value.
ru_ru: Чтобы изменить значение атрибута, щёлкните по значению.

source: If the Program specifies a version number of this License which applies to it and "any later version", you have the option of following the terms and conditions either of that version or of any later version published by the Free Software Foundation.
ru_ru: Если в Программе указан номер версии данной Лицензии, которая к ней применима, и слова "любая последующая версия", вы можете по выбору следовать определениям и условиям либо данной версии, либо любой последующей версии, опубликованной Фондом Свободного ПО.

source: If no, they light when the corresponding input is 0.
ru_ru: Если нет, то они горят, когда значение на соответствующем входе 0.

source: The font with which to render the label.
ru_ru: Шрифт, которым отрисовывается метка.

source: For example, if you select the AND gate tool and move the mouse into the window (without pressing the mouse's button), a gray outline of an AND gate will display where the AND gate will appear when the mouse is clicked.
ru_ru: Например, если вы выбираете инструмент Элемент И, и двигаете мышь по окну (без нажатия кнопки мыши), то серый контур элемента И отрисовывается там, где элемент И появится после нажатия мыши.

source: North edge, labeled c in (input, bit width 1)
ru_ru: Северный край, отмечен c in (вход, разрядность равна 1)

source: Enjoy your circuit-building!
ru_ru: Приятной постройки схем!

source: You can enter the logging module via the Logging... option from the Simulate menu.
ru_ru: Вы можете войти в модуль ведения журнала через пункт Запись в журнал... меню Моделировать.

source: Save Image...: Stores all values in memory into a file using the format described below.
ru_ru: Сохранить образ...: записывает все значения из памяти в файл, используя формат, описанный ниже.

source: // value we want to send on that port.
ru_ru: // значение, которое мы хотим послать на этот порт.

source: Output: Emits the value stored in the final (oldest) stage.
ru_ru: Выход: выдаёт значение, хранящееся в последней (старшей) ступени.

source: Poke Tool Behavior
ru_ru: Поведение Инструмента Нажатие

source: It's not really important to understanding how these examples work, so you can safely skip to the code below if you wish - particularly if you already know Gray codes.
ru_ru: Это не так важно для понимания того, как эти примеры работают, так что вы можете спокойно пропустить текст до кода ниже, если хотите; особенно если вы уже знаете код Грея.

source: To access it, bring up a pop-up menu for the memory component and select Edit Contents....
ru_ru: Для доступа к нему вызовите всплывающее меню компонента памяти и выберите Редактировать содержимое... .

source: Add Separator adds a separator to the end of the toolbar.
ru_ru: Добавить разделитель добавляет в конец панели инструментов разделитель.

source: Note that if you are using shaped gates, the west side of OR and NOR gates will be curved.
ru_ru: Заметьте, что если вы используете фигурные элементы, то западный край элементов ИЛИ и ИЛИ-НЕ будет искривлён.

source: View Simulation Tree
ru_ru: Показать дерево моделирования

source: This particular component is an incrementer, which takes an multibit input and produces the next Gray code following it in sequence.
ru_ru: Данный компонент - инкрементатор, который принимает многобитное значение на входе и выдаёт следующий код Грея в последовательности.

source: If any of the bits for a column are either floating or error values, then all pixels in the column are lit.
ru_ru: Если какие-либо биты в столбце имеют плавающее значение, или значение ошибки, то все пиксели в столбце горят.

source: As an example, consider the 4-bit Gray code listed below.
ru_ru: В качестве примера, рассмотрим 4-битный код Грея, приведённый ниже.

source: If the truth table is based on an existing circuit, you may see some pink squares in the output columns with "!!" in them.
ru_ru: Если таблица истинности основана на существующей схеме, то вы можете увидеть несколько розовых квадратов на столбцах с выходами с "!!" в них.

source: Therefore, by modifying or distributing the Program (or any work based on the Program), you indicate your acceptance of this License to do so, and all its terms and conditions for copying, distributing or modifying the Program or works based on it.
ru_ru: А значит, изменяя или распространяя Программу (или произведение, основанное на Программе), вы изъявляете свое согласие с этой Лицензией и всеми ее условиями о копировании, распространении или модификации Программы или произведений, основанных на ней.

source: The current bit continues to appear on the output.
ru_ru: Текущий бит по-прежнему поступает на выход.

source: The tab is divided into three vertical areas.
ru_ru: Вкладка разделена на три вертикальных области.

source: Select Rows/Columns
ru_ru: Выбор Строки/Столбцы

source: Next: Hex editor.
ru_ru: Далее: Шестнадцатеричный редактор.

source: If only all colleges and universities had their act as together and cared as much about excellent teaching as these colleges do!
ru_ru: Если бы только все колледжи и университеты действовали сообща и так заботились об отличном преподавании, как эти учреждения!

source: (NOT gates, of course, constitute an exception to this rule.) The Use NAND Gates Only option specifies that you would like it to translate the circuit into one using only NAND gates.
ru_ru: (Элементы НЕ, конечно же, являются исключением из этого правила). Опция Использовать только элементы И-НЕ указывает, что вы хотели бы, чтобы схема была переведена в такую, которая использует только элементы И-НЕ.

source: Configures how the clock input is interpreted.
ru_ru: Определяет, как обрабатывается тактовый вход.

source: The reset input resets the register's value to 0 (all zeroes) asynchronously; that is, as long as reset is 1, the value is pinned to 0, regardless of the clock input.
ru_ru: Вход Сброс асинхронно сбрасывает значение регистра на 0 (все нули), кроме того, пока на входе Сброс 1, значение фиксировано на 0, вне зависимости от тактового входа.

source: However, parties who have received copies, or rights, from you under this License will not have their licenses terminated so long as such parties remain in full compliance.
ru_ru: Однако лицензии лиц, получивших от вас копии или права согласно данной Универсальной Общественной Лицензии, не прекратят своего действия до тех пор, пока эти лица полностью соблюдают условия.

source: The maximum number of characters displayed in each row of terminal.
ru_ru: Максимальное количество символов, отображаемых в каждой строке терминала.

source: If this option is enabled, Logisim will occassionally (about once every 16 component reactions) make a component take one click longer than normal.
ru_ru: Если эта опция включена, Logisim будет время от времени (примерно один раз на 16 реакций компонента) заставлять компонент потратить на одно срабатывание больше, чем обычно.

source: (In particular, when Logisim creates a corresponding circuit, it will ignore such parentheses.)
ru_ru: (В частности, когда Logisim создаёт соответствующую схему, он будет игнорировать такие скобки.)
